dengan-ci4/Nutriscan-main/ci4/app/Controllers/ScanController.php

SELECT *
FROM `scan_history`
WHERE `user_id` = '13'
ORDER BY `scanned_at` DESC
---
public function history()
    {
        $session = session();
        $user_id = $session->get('user_id'); // pastikan session login

        $db = \Config\Database::connect();
        $builder = $db->table('scan_history');

        // Hapus data jika ada request POST
        if ($this->request->getMethod() === 'post' && $this->request->getPost('id')) {
            $id = $this->request->getPost('id');

            // Hapus data sesuai user & id
            $builder->where('id', $id)->where('user_id', $user_id)->delete();

            return redirect()->to('/history');
        }

        // Ambil data history user
        $history = $builder->where('user_id', $user_id)->orderBy('scanned_at', 'DESC')->get()->getResultArray();

DELETE FROM `scan_history`
WHERE `id` = '27'
AND `user_id` = '13'
---
    public function delete($id)
{
    $session = session();
    $user_id = $session->get('user_id');

    $db = \Config\Database::connect();
    $builder = $db->table('scan_history');

    // Cek apakah data milik user yang sedang login
    $deleted = $builder
        ->where('id', $id)
        ->where('user_id', $user_id)
        ->delete();